-- b_SQL기초 폴더 >> a_basic 파일

### 관계형 데이터베이스(RDBMS)의 개념 ###

### RDBMS (Related DataBase Management System)
# : 관계형 데이터베이스는 데이터를 테이블(표) 형태로 저장하고
#   , 테이블 간의 관계를 정의하여 데이터를 관리하는 데이터베이스 시스템

### RDBMS 특징
# : 테이블(관계)로 데이터를 저장
#   > 각 테이블은 행(레코드, row)과 열(속성, column)으로 구성
# : 스키마를 통해 데이터베이스를 관리
#   > 데이터베이스의 구조와 제약 조건을 정의하는 틀
#   > 테이블 간의 관계와 데이터 타입 등을 포함
# : SQL 언어를 사용
#   > 데이터를 정의, 조작, 제어하는 데 사용하는 언어
# : 데이터의 정확성과 일관성을 유지하는 여러 무결성 제약 조건을 지원

### RDBMS 주요 용어
# 1) 테이블(Table)
# : 데이터가 저장되는 기본 단위
# : 열(속성)과 행(레코드)으로 이루어져 있음

# 2) 열(Column)
# : 데이터를 저장하는 '세로'의 구분
# : 각 열은 특정 데이터 유형을 가짐

# 3) 행(Row)
# : 데이터의 한 레코드를 나타냄
# : 각 행은 고유한 데이터 세트를 가짐

# 4) 키(Key)
# : 테이블에서 레코드를 식별하는 데 사용되는 속성

### RDBMS 시스템의 종류
# 1) 'MySQL'
# : 오픈 소스 관계형 데이터베이스 - 웹 애플리케이션에서 주로 사용

# 2) Oracle
# : 상용 RDBMS 중 하나 - 대규모 기업용 데이터베이스 관리에 적합

# PostgreSQL, Microsoft SQL Server 등